{"_id": "54b6901fd46bb466f77f1846", "categories": {"audience": [{"fullname": "Science/Research", "fullpath": "Intended Audience :: by Industry or Sector :: Science/Research", "id": 367, "shortname": "scienceresearch"}], "database": [], "developmentstatus": [{"fullname": "4 - Beta", "fullpath": "Development Status :: 4 - Beta", "id": 10, "shortname": "beta"}, {"fullname": "3 - Alpha", "fullpath": "Development Status :: 3 - Alpha", "id": 9, "shortname": "alpha"}], "environment": [{"fullname": "Console/Terminal", "fullpath": "User Interface :: Textual :: Console/Terminal", "id": 460, "shortname": "ui_consoleterm"}], "language": [{"fullname": "Python", "fullpath": "Programming Language :: Python", "id": 178, "shortname": "python"}], "license": [{"fullname": "Creative Commons Attribution License", "fullpath": "License :: Creative Commons Attribution License", "id": 868, "shortname": "ccal"}], "os": [], "topic": [{"fullname": "Bio-Informatics", "fullpath": "Topic :: Scientific/Engineering :: Bio-Informatics", "id": 252, "shortname": "bioinformatics"}], "translation": [{"fullname": "English", "fullpath": "Translations :: English", "id": 275, "shortname": "english"}]}, "creation_date": "2015-01-14", "developers": [{"name": "Marcos J Arauzo-Bravo", "url": "http://sourceforge.net/u/marara/", "username": "marara"}], "external_homepage": "http://p3bsseq.sourceforge.net", "icon_url": null, "labels": ["Bioinformatics", "Next Generation Sequencing", "DNA methylation analysis"], "moved_to_url": "", "name": "P3BSseq", "preferred_support_tool": "_url", "preferred_support_url": "http://computational-biology.mpi-muenster.mpg.de/publications/ParallelDNAMethylationSequencing/P3BSseq.zip", "private": false, "screenshots": [{"caption": "P3BSseq flow diagram of the pipelines for single-end and paired-end reads processing. S1 – S6, and P1 - P8 are the different thresholds regulating the decision process for single-end and for paired-end reads respectively, they have default values and can be tuned in the parameter file. The block gray colors are proportional to the number of parallel processes (darker color corresponds to more processes running in parallel)", "thumbnail_url": "http://sourceforge.net/p/p3bsseq/screenshot/Figure4.png/thumb", "url": "http://sourceforge.net/p/p3bsseq/screenshot/Figure4.png"}, {"caption": "Five folder structure associated to the use of P3BSseq. The REFERENCE GENOME folder hosts the different reference genomes, their annotation and indexing. Once a reference genome has been downloaded and indexed, further processing is not necessary. INPUT FILES folder hosts the raw reads in fastq format of each methylomics sample to be processed. P3BSseq folder hosts the P3BSseq software. OUTPUT folder hosts the output subfolders and files associated with each methylomics sample processed. The names of the five main folders can be changed by the user. To allow the executable files of P3BSseq to find them, the names of the five main folders have to be provided in the parameter files of the PARAMETER folder. The legend to the right shows the types of folders and files.", "thumbnail_url": "http://sourceforge.net/p/p3bsseq/screenshot/Figure5.png/thumb", "url": "http://sourceforge.net/p/p3bsseq/screenshot/Figure5.png"}, {"caption": "Flow-time diagrams of the P3BSseq parallel performance. P3BSseq flow-time diagrams of the simultaneous execution in a three core CPU of a methylome split into five fragments (Frag.). The number inside each box is the fragment index. The three major tasks of the methylome processing are quality checking, trimming and alignment. The vertical arrows mark the starting points of each task for each fragment, and their line styles represent the identity of the parallel process required to finalize each task (the first scheduled parallel processes are represented by solid, the second by dashed, and the third by dashed point lines). The horizontal arrows mark the time flow of each task. The block arrows mark the time occupancy of each core for the processing of each fragment, and their gray color is proportional to the required memory usage (darker color corresponds to higher memory usage).", "thumbnail_url": "http://sourceforge.net/p/p3bsseq/screenshot/Figure3.png/thumb", "url": "http://sourceforge.net/p/p3bsseq/screenshot/Figure3.png"}], "short_description": "Bisulfite sequencing (BSseq) processing is among the most cumbersome next generation sequencing (NGS) applications. Though some BSseq processing tools are available, they are scattered, require puzzling parameters and are running-time and memory-usage demanding. We have developed P3BSseq, a parallel processing pipeline for fast, accurate and automatic analysis of BSseq reads that trims, aligns, annotates, records the intermediate results, performs bisulfite conversion quality assessment, generates BED methylome and report files following the NIH standards. P3BSseq outperforms the known BSseq mappers regarding running time, computer hardware requirements and is optimized to process. We optimized the P3BSseq parameters for both directional and non-directional libraries, and for both single-end and paired-end reads of Whole Genome and Reduced Representation BSseq. P3BSseq is a user-friendly streamlined solution for BSseq upstream analysis, requiring only  basic computer and NGS knowledge", "shortname": "p3bsseq", "socialnetworks": [{"accounturl": "", "socialnetwork": "Twitter"}, {"accounturl": null, "socialnetwork": "Facebook"}], "status": "active", "summary": "Parallel processing pipeline for analysis of bisulfite sequencing data", "tools": [{"label": "Activity", "mount_point": "activity", "name": "activity"}, {"label": "Files", "mount_point": "files", "name": "files"}, {"label": "Summary", "mount_point": "summary", "name": "summary", "sourceforge_group_id": 2393465}, {"label": "Reviews", "mount_point": "reviews", "name": "reviews"}, {"label": "Support", "mount_point": "support", "name": "support"}, {"label": "Wiki", "mount_point": "wiki", "name": "wiki"}, {"label": "Code", "mount_point": "code", "name": "git"}, {"label": "Tickets", "mount_point": "tickets", "name": "tickets"}, {"label": "Discussion", "mount_point": "discussion", "name": "discussion"}], "url": "http://sourceforge.net/p/p3bsseq/", "video_url": null}
