{"_id": "540c1b22bcf63a61289f7c48", "categories": {"audience": [], "database": [], "developmentstatus": [], "environment": [], "language": [], "license": [], "os": [], "topic": [], "translation": []}, "creation_date": "2014-09-07", "developers": [{"name": "Alberto Magi", "url": "http://sourceforge.net/u/albertomagi/", "username": "albertomagi"}], "external_homepage": "http://rarevator.sourceforge.net", "icon_url": null, "labels": [], "moved_to_url": "", "name": "RAREVATOR", "preferred_support_tool": "", "preferred_support_url": "", "private": false, "screenshots": [{"caption": "GC content,mappability and population distribution of RRAloci. Panels a and b report the distribution of GC-content percent and mappability of the 100 bp region surrounding each RRA locus (for RRA classes A, B and C) compared to randomly sampled 100 bp regions. Panel c report the distribution of RRA loci across macro populations: African (AFR), American (AMR), Asian (ASN), European (EUR), shared by none (None), two (Two Pop), three (Three Pop) and four populations (Four Pop).", "thumbnail_url": "http://sourceforge.net/p/rarevator/screenshot/Figure1.jpg/thumb", "url": "http://sourceforge.net/p/rarevator/screenshot/Figure1.jpg"}, {"caption": "Variant calling scheme for classical SNP and InDel caller and RAREVATOR. Panels a and b report the calling scheme of classical germline and somatic variant callers. Panels c and d report the calling scheme of RAREVATOR for germline and somatic variants. Classical germline callers (panel a) are devised to detect variants from the comparison to the reference genome and, clearly, they are not able to detect variants in RRA loci when the reference allele is in homozygous state. Also heterozygous calls are missed by classical resequencing analysis pipelines, since variant calling is usually followed by a filtering step in which known variants with allele frequency larger than a predefined threshold (usually 0.01) are discarded. Somatic callers (panel b) are devised to detect every kind of differences between normal and tumor samples. However, the probabilistic calling step is followed by a filtering step in which germline variants found in normal sample are used to discard somatic calls. RAREVATOR exploits the GATK Unified Genotyper for interrogating all the RRA loci and detecting germline and somatic variants that contain the reference allele (panels c and d).", "thumbnail_url": "http://sourceforge.net/p/rarevator/screenshot/Figure2.jpg/thumb", "url": "http://sourceforge.net/p/rarevator/screenshot/Figure2.jpg"}, {"caption": "Network of TCGA driver genes containing RRA loci in GRCh37. To build the network we selected all the interactions of HumanNetv1 that link the 291 TCGA driver genes [41]. Node colors represent the most severe RRA variant contained by each gene: none RRA (white), non-exonic (grey), synonymous (orange), splicing (red) and missense RRA (magenta). Node border colors represent the TCGA cancer type for which the gene has been predicted to be a driver with maximum mutation frequency: AML (Acute Myeloid Leukemia), BLCA (Bladder Urothelial Carcinoma), BRCA (Breast invasive carcinoma), COAD (Colon adenocarcinoma), GBM (Glioblastoma multiforme), HNSC (Head and Neck squamous cell carcinoma), KIRC (Kidney renal clear cell carcinoma), LUAD (Lung adenocarcinoma), LUSC (Lung squamous cell carcinoma), OV (Ovarian serous cystadenocarcinoma), UCEC (Uterine Corpus Endometrial Carcinoma), UVM (Uveal Melanoma). Node radius gives a measure of the maximum mutation frequency of the driver gene in the TCGA cancer dataset coded by the border color.", "thumbnail_url": "http://sourceforge.net/p/rarevator/screenshot/Figure3.jpg/thumb", "url": "http://sourceforge.net/p/rarevator/screenshot/Figure3.jpg"}], "short_description": "RAREVATOR (RAre REference VAriant annotaTOR) is a tool for the identification and annotation of germline and somatic variants in rare reference allele loci from second generation sequencing data.\r\n\r\nRAREVATOR has been published on BMC Genomics.\r\n\r\nMagi A, D'Aurizio R, Palombo F, Cifola I, Tattini L, Semeraro R, Pippucci T, Giusti B, Romeo G, Abbate R, Gensini GF. Characterization and identification of hidden rare variants in the human genome. BMC Genomics. 2015 Apr 24;16:340. doi: 10.1186/s12864-015-1481-9.", "shortname": "rarevator", "socialnetworks": [{"accounturl": "", "socialnetwork": "Twitter"}, {"accounturl": null, "socialnetwork": "Facebook"}], "status": "active", "summary": "", "tools": [{"label": "Activity", "mount_point": "activity", "name": "activity"}, {"label": "Files", "mount_point": "files", "name": "files"}, {"label": "Summary", "mount_point": "summary", "name": "summary", "sourceforge_group_id": 2319187}, {"label": "Reviews", "mount_point": "reviews", "name": "reviews"}, {"label": "Support", "mount_point": "support", "name": "support"}, {"label": "Code", "mount_point": "code", "name": "git"}, {"label": "Wiki", "mount_point": "wiki", "name": "wiki"}, {"label": "Discussion", "mount_point": "discussion", "name": "discussion"}, {"label": "Tickets", "mount_point": "tickets", "name": "tickets"}], "url": "http://sourceforge.net/p/rarevator/", "video_url": null}
